day1/test.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-12-09 Mon 17:43 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Test</title>
<meta name="author" content="Abhishek Raj" />
<meta name="generator" content="Org Mode" />

</head>
<body>
<div id="content" class="content">
<h1 class="title">Test</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org2ecde4f">1. Performance Metrics</a>
<ul>
<li><a href="#org2735b33">1.1. 1. Performance Metrics Overview</a></li>
<li><a href="#org8ecadd6">1.2. 2. Speedup</a></li>
<li><a href="#org1730b5e">1.3. 3. Efficiency</a></li>
<li><a href="#org41e0139">1.4. 4. Amdahl&rsquo;s Law</a></li>
<li><a href="#org4180ea9">1.5. 5. Weak and Strong Scalability</a></li>
<li><a href="#orgf624696">1.6. 6. Performance/Watt</a></li>
<li><a href="#orgf598c47">1.7. 7. Arithmetic Intensity (FLOPS/Bytes)</a></li>
<li><a href="#orgd110387">1.8. 8. Summary</a></li>
<li><a href="#org85ab07c">1.9. Exercises</a></li>
<li><a href="#org2245171">1.10. References</a></li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-org2ecde4f" class="outline-2">
<h2 id="org2ecde4f"><span class="section-number-2">1.</span> Performance Metrics</h2>
<div class="outline-text-2" id="text-1">
<p>
The study of performance metrics is crucial in evaluating the efficiency and scalability of computational systems. In this module, we will discuss various performance metrics such as Speedup, Efficiency, Amdahl&rsquo;s Law, scalability (both weak and strong), performance per watt, and Arithmetic Intensity. These metrics help in understanding how well a system performs and where improvements can be made.
</p>
</div>
<div id="outline-container-org2735b33" class="outline-3">
<h3 id="org2735b33"><span class="section-number-3">1.1.</span> 1. Performance Metrics Overview</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Performance metrics are quantitative measures used to evaluate the efficiency, speed, and scalability of computing systems. They allow us to compare different systems, configurations, and optimization strategies.
</p>

<p>
Some common performance metrics include:
</p>
<ul class="org-ul">
<li>Execution Time (Time to run a given workload)</li>
<li>Throughput (Amount of work done per unit time)</li>
<li>Latency (Time to complete a task or request)</li>
<li>Energy consumption (Power usage over time)</li>
</ul>
</div>
</div>
<div id="outline-container-org8ecadd6" class="outline-3">
<h3 id="org8ecadd6"><span class="section-number-3">1.2.</span> 2. Speedup</h3>
<div class="outline-text-3" id="text-1-2">
<p>
Speedup is a metric that compares the performance of a parallel system to a sequential system.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> Speedup is defined as the ratio of the time taken to execute a task sequentially to the time taken to execute the same task in parallel.
</p>

<p>
\[
  \text{Speedup} = \frac{T_{\text{sequential}}}{T_{\text{parallel}}}
  \]
</p></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
Suppose a task takes 100 seconds to execute sequentially and 25 seconds to execute in parallel on 4 processors.
</p>

<p>
\[
  \text{Speedup} = \frac{100}{25} = 4
  \]
</p>

<p>
This means the parallel system is 4 times faster than the sequential system.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org1730b5e" class="outline-3">
<h3 id="org1730b5e"><span class="section-number-3">1.3.</span> 3. Efficiency</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Efficiency is a measure of how effectively the available processors are utilized in a parallel system.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> Efficiency is the ratio of speedup to the number of processors used.
</p>

<p>
\[
  \text{Efficiency} = \frac{\text{Speedup}}{P}
  \]
</p>

<p>
Where \( P \) is the number of processors.
</p></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
From the previous example, if the parallel system uses 4 processors:
</p>

<p>
\[
  \text{Efficiency} = \frac{4}{4} = 1
  \]
</p>

<p>
The efficiency is 1, meaning all processors are fully utilized.
</p>

<p>
If the speedup was only 3 instead of 4, efficiency would be:
</p>

<p>
\[
  \text{Efficiency} = \frac{3}{4} = 0.75
  \]
</p>

<p>
This indicates that some processors are underutilized.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org41e0139" class="outline-3">
<h3 id="org41e0139"><span class="section-number-3">1.4.</span> 4. Amdahl&rsquo;s Law</h3>
<div class="outline-text-3" id="text-1-4">
<p>
Amdahl’s Law provides a theoretical upper bound on the speedup of a parallel program.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> Amdahl’s Law is used to predict the maximum speedup of a program when only a portion of the program can be parallelized.
</p>

<p>
\[
  S = \frac{1}{(1 - P) + \frac{P}{N}}
  \]
</p>

<p>
Where:
</p>
<ul class="org-ul">
<li>\( S \) is the speedup,</li>
<li>\( P \) is the proportion of the program that can be parallelized,</li>
<li>\( N \) is the number of processors.</li>
</ul></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
Let’s say 90% of a program can be parallelized, and it runs on 4 processors.
</p>

<p>
\[
  S = \frac{1}{(1 - 0.9) + \frac{0.9}{4}} = \frac{1}{0.1 + 0.225} = \frac{1}{0.325} \approx 3.08
  \]
</p>

<p>
This means the maximum speedup is approximately 3.08, even though 90% of the program is parallelizable.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org4180ea9" class="outline-3">
<h3 id="org4180ea9"><span class="section-number-3">1.5.</span> 5. Weak and Strong Scalability</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Scalability refers to the ability of a system to handle increasing problem sizes or processor counts efficiently.
</p>

<ul class="org-ul">
<li><b><b>Strong Scalability:</b></b> Strong scalability measures how the execution time decreases as more processors are added, with a fixed problem size.

<ul class="org-ul">
<li><b><b>Goal:</b></b> To achieve faster execution by increasing the number of processors for a fixed-size workload.</li>
</ul></li>

<li><b><b>Weak Scalability:</b></b> Weak scalability measures how well the system performs as the problem size grows with the number of processors.

<ul class="org-ul">
<li><b><b>Goal:</b></b> To maintain a constant execution time by increasing the problem size in proportion to the number of processors.</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgf624696" class="outline-3">
<h3 id="orgf624696"><span class="section-number-3">1.6.</span> 6. Performance/Watt</h3>
<div class="outline-text-3" id="text-1-6">
<p>
Performance per watt measures the efficiency of a system in terms of energy consumption. It is especially important in mobile and energy-conscious computing environments.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> It is the ratio of the system&rsquo;s performance (e.g., throughput) to its power consumption.
</p>

<p>
\[
  \text{Performance/Watt} = \frac{\text{Performance (e.g., FLOPS)}}{\text{Power (W)}}
  \]
</p></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
If a system performs 1 billion floating point operations per second (GFLOPS) and consumes 100 watts of power:
</p>

<p>
\[
  \text{Performance/Watt} = \frac{1 \text{ GFLOPS}}{100 \text{ W}} = 0.01 \text{ GFLOPS/W}
  \]
</p>

<p>
This means the system performs 0.01 GFLOPS for each watt of power consumed.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgf598c47" class="outline-3">
<h3 id="orgf598c47"><span class="section-number-3">1.7.</span> 7. Arithmetic Intensity (FLOPS/Bytes)</h3>
<div class="outline-text-3" id="text-1-7">
<p>
Arithmetic intensity measures the ratio of floating point operations (FLOPS) to memory operations (bytes). It is a key indicator of whether a program is bound by computational resources or memory bandwidth.
</p>

<ul class="org-ul">
<li><p>
<b><b>Definition:</b></b> It is the ratio of the number of floating point operations (FLOPS) to the amount of data moved (in bytes).
</p>

<p>
\[
  \text{Arithmetic Intensity} = \frac{\text{FLOPS}}{\text{Bytes}}
  \]
</p></li>

<li><p>
<b><b>Example:</b></b>
</p>

<p>
If a program performs 10^9 floating point operations and moves 10^8 bytes of data:
</p>

<p>
\[
  \text{Arithmetic Intensity} = \frac{10^9}{10^8} = 10
  \]
</p>

<p>
This means for every byte of data moved, the program performs 10 floating point operations.
</p></li>
</ul>
</div>
</div>
<div id="outline-container-orgd110387" class="outline-3">
<h3 id="orgd110387"><span class="section-number-3">1.8.</span> 8. Summary</h3>
<div class="outline-text-3" id="text-1-8">
<p>
Understanding and applying these performance metrics help in assessing the efficiency of parallel systems, optimizing performance, and guiding design choices. The use of these metrics allows for better decision-making in selecting hardware, software, and algorithms for various computational tasks.
</p>
</div>
</div>
<div id="outline-container-org85ab07c" class="outline-3">
<h3 id="org85ab07c"><span class="section-number-3">1.9.</span> Exercises</h3>
<div class="outline-text-3" id="text-1-9">
<ol class="org-ol">
<li>Calculate the speedup and efficiency for a given problem where the sequential execution time is 200 seconds, and the parallel execution time on 8 processors is 40 seconds.</li>
<li>Given a program that can be 80% parallelized, calculate the speedup for 4 processors using Amdahl&rsquo;s Law.</li>
<li>Compare the strong scalability of a system using 2 processors and 4 processors for a fixed-size problem. Determine the speedup for each case.</li>
<li>Calculate the performance/watt for a system that performs 5 GFLOPS and consumes 250 watts of power.</li>
<li>Calculate the arithmetic intensity of a program that performs 2 * 10^9 FLOPS and moves 5 * 10^8 bytes of data.</li>
</ol>
</div>
</div>
<div id="outline-container-org2245171" class="outline-3">
<h3 id="org2245171"><span class="section-number-3">1.10.</span> References</h3>
<div class="outline-text-3" id="text-1-10">
<ul class="org-ul">
<li>&ldquo;Parallel Programming in C with MPI and OpenMP,&rdquo; Quinn, M. J., 2004.</li>
<li>&ldquo;The Art of Computer Systems Performance Analysis,&rdquo; W. W. H. E. Morgan Kaufmann, 1991.</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Abhishek Raj</p>
<p class="date">Created: 2024-12-09 Mon 17:43</p>
</div>
</body>
</html>
